index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-17 Tue 17:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Johnny Megahan, Software Engineer - Tokyo, Japan</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Johnny Megahan" />
<meta name="description" content="The home page of Johnny Megahan, a software engineer."
 />
</head>
<body>
<div id="content">
<h1 class="title">Johnny Megahan, Software Engineer - Tokyo, Japan</h1>

<div id="outline-container-orgf788bc3" class="outline-2">
<h2 id="orgf788bc3">こんにちは！</h2>
<div class="outline-text-2" id="text-orgf788bc3">
<p>
Hello, I'm Johnny.
</p>

<p>
I like to focus on fitting functional patterns into domain
logic. Recently I've done that in Haskell, Javascript, and OCaml.
</p>

<p>
Here's a link to my <a href="bookshelf.html">reading list</a>, though it is perpetually out of
date.
</p>

<p>
Shibuya, Tokyo is my home, after having spent much of my time in San
Francisco, Wilmington, and Pittsburgh.
</p>

<p>
I am most happy in the back corner booth of a warm cafe.
</p>

<p>
After some time spent studying Japanese and Category Theory, I am
currently working at Coursebase (Tokyo) on educational tools.
</p>

<p>
Previous to that, I was:
</p>
<ul class="org-ul">
<li>Senior Engineer on Uber's Core Web Platform team</li>
<li>Senior Engineer on Apple's Music team (for iTunes Desktop, Apple TV
Music, and IOS Music)</li>
<li>Senior Engineer on Beats Music's Web team</li>
<li>Software Engineer at MOG, PBS, and others.</li>
</ul>

<p>
You may find me on social media at the following sites:
</p>
<ul class="org-ul">
<li><a href="http://twitter.com/johnmegahan">twitter: @johnmegahan</a></li>
<li><a href="https://github.com/johnmegahan">github: @johnmegahan</a></li>
<li><a href="http://www.linkedin.com/in/johnmegahan/">linkedin: @johnmegahan</a></li>
</ul>

<p>
You may email me at <a href="mailto:megahanj@acm.org">megahanj@acm.org</a>
</p>
</div>
</div>
</div>
</body>
</html>
